In [1]:
import pandas as pd

In [3]:
# creating data frame
data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, None, 28],
    "city": ["New York", "Paris", "Paris", "London", None]
}

df = pd.DataFrame(data)
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None

In [62]:
# saving our dataframe (df) as a csv file
df.to_csv("practiceData.csv", index=False)

In [45]:
# exploring data
df.info()
df.head()
df.describe()
df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

name    0
age     1
city    1
dtype: int64

In [46]:
# Cleaning data

# fill messing ages with mean
df['age'] = df["age"].fillna(df["age"].mean()) # Finds mean and store it to updated dataframe 
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David  29.5    London
4      Eva  28.0      None

In [54]:
# Fill missing city with "Unknown"
df["city"] = df["city"].fillna("Unknown")
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David  29.5    London
4      Eva  28.0   Unknown

In [55]:
# filter age greater then 30
df[df['age'] > 30]

      name   age   city
2  Charlie  35.0  Paris

In [57]:
# sort by age
# df.sort_values(by='age')
df.sort_values('age')

      name   age      city
0    Alice  25.0  New York
4      Eva  28.0   Unknown
3    David  29.5    London
1      Bob  30.0     Paris
2  Charlie  35.0     Paris

In [61]:
# Add new column
df["age_category"] = df["age"].apply(lambda x : "Young" if x < 30 else "Adult")
df

      name   age      city  age_catoagry age_category
0    Alice  25.0  New York            22        Young
1      Bob  30.0     Paris            22        Adult
2  Charlie  35.0     Paris            22        Adult
3    David  29.5    London            22        Young
4      Eva  28.0   Unknown            22        Young

In [9]:
# sort values
# df.sort_values("age")
# df.sort_values("city")

      name   age      city
3    David   NaN    London
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
4      Eva  28.0      None

In [18]:
# filter dat
df[df["age"] < 30] # filter data by comparing 
df["age"] < 30

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None

In [26]:
# new data set
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8],
    "Name": ["Alice", "Bob", "CHARLIE", "Dana", "", "Frank", "Grace", "Henry"],
    "Age": [29, None, 35, 28, 22, "thirty", 27, 40],
    "Email": [
        "alice@example.com",
        "bob_at_example.com",
        "charlie@example",
        "dana@example.com",
        "emily@example.com",
        "frank@example.com",
        "grace@example.com",
        None
    ],
    "Join_Date": [
        "2021-03-15",
        "2020/12/01",
        "March 5, 2019",
        "2019-07-21",
        "2022-01-10",
        "2021-11-30",
        "15-08-2020",
        "2018-06-01"
    ],
    "Salary": [55000, 48000, 62000, None, 50000, 58000, 51000, 70000]
}

df = pd.DataFrame(data)
print(df)

   ID     Name     Age               Email      Join_Date   Salary
0   1    Alice      29   alice@example.com     2021-03-15  55000.0
1   2      Bob    None  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE      35     charlie@example  March 5, 2019  62000.0
3   4     Dana      28    dana@example.com     2019-07-21      NaN
4   5               22   emily@example.com     2022-01-10  50000.0
5   6    Frank  thirty   frank@example.com     2021-11-30  58000.0
6   7    Grace      27   grace@example.com     15-08-2020  51000.0
7   8    Henry      40                None     2018-06-01  70000.0

In [4]:
df

   ID     Name     Age               Email      Join_Date   Salary
0   1    Alice      29   alice@example.com     2021-03-15  55000.0
1   2      Bob    None  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE      35     charlie@example  March 5, 2019  62000.0
3   4     Dana      28    dana@example.com     2019-07-21      NaN
4   5               22   emily@example.com     2022-01-10  50000.0
5   6    Frank  thirty   frank@example.com     2021-11-30  58000.0
6   7    Grace      27   grace@example.com     15-08-2020  51000.0
7   8    Henry      40                None     2018-06-01  70000.0

In [5]:
df.info

<bound method DataFrame.info of    ID     Name     Age               Email      Join_Date   Salary
0   1    Alice      29   alice@example.com     2021-03-15  55000.0
1   2      Bob    None  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE      35     charlie@example  March 5, 2019  62000.0
3   4     Dana      28    dana@example.com     2019-07-21      NaN
4   5               22   emily@example.com     2022-01-10  50000.0
5   6    Frank  thirty   frank@example.com     2021-11-30  58000.0
6   7    Grace      27   grace@example.com     15-08-2020  51000.0
7   8    Henry      40                None     2018-06-01  70000.0>

In [6]:
df.describe()

            ID        Salary
count  8.00000      7.000000
mean   4.50000  56285.714286
std    2.44949   7761.320457
min    1.00000  48000.000000
25%    2.75000  50500.000000
50%    4.50000  55000.000000
75%    6.25000  60000.000000
max    8.00000  70000.000000

In [7]:
df.isna().sum()

ID           0
Name         0
Age          1
Email        1
Join_Date    0
Salary       1
dtype: int64

In [35]:
# lets first fill missing values :
df["Age"] = df["Age"].fillna(0)
df= df.replace("", pd.NA)

   ID     Name     Age               Email      Join_Date   Salary     name
0   1    Alice      29   alice@example.com     2021-03-15  55000.0    Alice
1   2      Bob       0  bob_at_example.com     2020/12/01  48000.0      Bob
2   3  CHARLIE      35     charlie@example  March 5, 2019  62000.0  CHARLIE
3   4     Dana      28    dana@example.com     2019-07-21      NaN     Dana
4   5     <NA>      22   emily@example.com     2022-01-10  50000.0     <NA>
5   6    Frank  thirty   frank@example.com     2021-11-30  58000.0    Frank
6   7    Grace      27   grace@example.com     15-08-2020  51000.0    Grace
7   8    Henry      40                None     2018-06-01  70000.0    Henry

In [42]:
# lets fill names
df["Name"] = df["Name"].fillna("Uknown")

In [64]:
# Convert to numeric, invalid parsing becomes NaN - age

df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [66]:
# fixing emails

def fixEmails(email):
    if pd.isna(email):
        return email
    if not email.endswith('@example.com'):
        return email + "@example.com"
    return email

df["Email"] = df["Email"].apply(fixEmails)
df

,ID,Name,Age,Email,Join_Date,Salary,name
0,1,Alice,29.0,alice@example.com,2021-03-15,55000.0,Alice
1,2,Bob,0.0,bob_at_example.com@example.com,NaN,48000.0,Bob
2,3,CHARLIE,35.0,charlie@example.com,NaN,62000.0,CHARLIE
3,4,Dana,28.0,dana@example.com,2019-07-21,NaN,Dana
4,5,Uknown,22.0,emily@example.com,2022-01-10,50000.0,<NA>
5,6,Frank,NaN,frank@example.com,2021-11-30,58000.0,Frank
6,7,Grace,27.0,grace@example.com,NaN,51000.0,Grace
7,8,Henry,40.0,None,2018-06-01,70000.0,Henry

In [65]:
# lets fix dates 
df

   ID     Name   Age                Email   Join_Date   Salary     name
0   1    Alice  29.0    alice@example.com  2021-03-15  55000.0    Alice
1   2      Bob   0.0   bob_at_example.com         NaN  48000.0      Bob
2   3  CHARLIE  35.0  charlie@example.com         NaN  62000.0  CHARLIE
3   4     Dana  28.0     dana@example.com  2019-07-21      NaN     Dana
4   5   Uknown  22.0    emily@example.com  2022-01-10  50000.0     <NA>
5   6    Frank   NaN    frank@example.com  2021-11-30  58000.0    Frank
6   7    Grace  27.0    grace@example.com         NaN  51000.0    Grace
7   8    Henry  40.0                 None  2018-06-01  70000.0    Henry